main/InformationRegisters/ПрививкиВОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ПрививкиВОчереди</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозрастВакцинации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ребенок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Дети</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инфекция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инфекции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Прививка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прививки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВакцинации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

main/Catalogs/Инфекции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Инфекции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>МесяцаВакцинаций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

main/CommonModules/РаботаСКалендаремСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура СформироватьНациональныйКалендарьПрививок(РебенокСсылка, ДатаРождения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнфекцииМесяцаВакцинаций.Ссылка КАК Инфекция,
		|	ИнфекцииМесяцаВакцинаций.Месяц КАК Месяц
		|ИЗ
		|	Справочник.Инфекции.МесяцаВакцинаций КАК ИнфекцииМесяцаВакцинаций";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаМесяцаВакцинаций = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаМесяцаВакцинаций.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПрививкиВОчереди.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Ребенок = РебенокСсылка;
		МенеджерЗаписи.Инфекция = ВыборкаМесяцаВакцинаций.Инфекция;
		МенеджерЗаписи.ВозрастВакцинации = ВыборкаМесяцаВакцинаций.Месяц;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
